app/views/users/index.html.erb

  <% if user.profile %>
    <% if !user.profile.real_name.empty? %>
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]