app/views/users/show.html.erb

SELECT "interests".* FROM "interests" INNER JOIN "user_interests" ON "interests"."id" = "user_interests"."interest_id" WHERE "user_interests"."user_id" = ?  [["user_id", 2]]
---
<ul>
<% @user.interests.each do |interest| %>