app/views/posts/index.html.erb

<% @posts.each do |post| %>
  <h3> <%= "#{post.title} [posted at #{post.created_at}]" %> </h3>
---
INSERT INTO "posts" ("title", "body", "user_id") VALUES (?, ?, ?)  [["title", "Test Post 2"], ["body", "Hi again"], ["user_id", 1]]