app/controllers/blogposts_controller.rb

INSERT INTO "blogposts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "I wonder if this will work"], ["body", "Let's try it out! "], ["user_id", 2], ["created_at", "2018-11-16 23:47:25.161260"], ["updated_at", "2018-11-16 23:47:25.161260"]]
---
  def create
    @blogpost = Blogpost.new
    @blogpost.user_id = params[:user_id]
    @blogpost.title = params[:blogpost][:title]
    @blogpost.body = params[:blogpost][:body]
    @blogpost.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @user = User.find(params[:user_id])
    @blogpost = Blogpost.find(params[:id])

SELECT  "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "blogposts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "blogposts"."id" = ?  [["title", "first blogpost edited"], ["body", "I wonder if this edit will work"], ["updated_at", "2018-11-17 00:48:12.089013"], ["id", 3]]
---
  def update
    blogpost = Blogpost.find(params[:id])
    blogpost.title = params[:blogpost][:title] if params[:blogpost][:title]
    blogpost.body = params[:blogpost][:body] if params[:blogpost][:body]
    blogpost.save

SELECT  "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogposts" WHERE "blogposts"."id" = ?  [["id", 1]]
---
  def destroy
    blogpost = Blogpost.find(params[:id])
    blogpost.destroy