app/controllers/blogpostlikes_controller.rb

  def create
    Blogpostlike.create(user_id: params[:users_id], blogpost_id: params[:blogposts_id])
---
INSERT INTO "blogpostlikes" ("blogpost_id", "user_id") VALUES (?, ?)  [["blogpost_id", 2], ["user_id", 1]]

  def destroy
    blogpostlike = Blogpostlike.find(params[:id])
    blogpostlike.destroy
---
SELECT  "blogpostlikes".* FROM "blogpostlikes" WHERE "blogpostlikes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogpostlikes" WHERE "blogpostlikes"."id" = ?  [["id", 1]]