app/controllers/commentlikes_controller.rb

  def create
    Commentlike.create(user_id: params[:users_id], comment_id: params[:comments_id])
---
INSERT INTO "commentlikes" ("comment_id", "user_id") VALUES (?, ?)  [["comment_id", 8], ["user_id", 1]]

  def destroy
    commentlike = Commentlike.find(params[:id])
    commentlike.destroy
---
SELECT  "commentlikes".* FROM "commentlikes" WHERE "commentlikes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "commentlikes" WHERE "commentlikes"."id" = ?  [["id", 3]]