app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "I wonder if this will show up"], ["post_id", 1], ["user_id", 1], ["created_at", "2018-11-17 06:53:07.271054"], ["updated_at", "2018-11-17 06:53:07.271054"]]
---
  def create
    #binding.pry
    post_id = params[:post_id]
    @comment = Comment.new(body: params[:comment][:body], post_id: post_id, user_id: current_user.id)
    if @comment.save