app/controllers/interests_controller.rb

SELECT "interests".* FROM "interests"
DELETE FROM "user_interests" WHERE "user_interests"."user_id" = ? AND "user_interests"."interest_id" IN (?, ?, ?, ?, ?, ?, ?)  [["user_id", 3], ["interest_id", 1], ["interest_id", 4], ["interest_id", 1], ["interest_id", 4], ["interest_id", 5], ["interest_id", 6], ["interest_id", 2]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "interests"."id" FROM "interests" INNER JOIN "user_interests" ON "interests"."id" = "user_interests"."interest_id" WHERE "user_interests"."user_id" = ?  [["user_id", 2]]
SELECT  "interests".* FROM "interests" WHERE "interests"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  1 AS one FROM "interests" INNER JOIN "user_interests" ON "interests"."id" = "user_interests"."interest_id" WHERE "user_interests"."user_id" = ? AND "interests"."id" = ? LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
INSERT INTO "user_interests" ("user_id", "interest_id") VALUES (?, ?)  [["user_id", 3], ["interest_id", 1]]
---
  def index
    @interests = Interest.all
    @interest = Interest.new
    interests = params[:current_user][:interest_ids] if params[:current_user] && params[:current_user][:interest_ids]
    if interests
      current_user.interests.clear
      interests.each do |interest_id|
        if interest_id.to_i && !interest_id.empty?
          interest = Interest.find(interest_id.to_i)
          current_user.interests << interest if interest && !current_user.interests.include?(interest)

INSERT INTO "interests" ("title", "description") VALUES (?, ?)  [["title", "Skryim"], ["description", "A fantasy role-playing game for computer and console. "]]
SELECT "interests".* FROM "interests"
---
  def create
    @interest = Interest.new(title: params[:interest][:title], description: params[:interest][:description])
    if @interest.save
      redirect_to interests_path
    else
      @interests = Interest.all