app/controllers/posts_controller.rb

  def index
    #binding.pry
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    #binding.pry
    @post = Post.new(title: params[:post][:title], body: params[:post][:body])
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test4 first post"], ["body", "Hi everybody!"], ["user_id", 4], ["created_at", "2018-11-17 16:20:46.158782"], ["updated_at", "2018-11-17 16:20:46.158782"]]