app/controllers/postlikes_controller.rb

INSERT INTO "postlikes" ("user_id", "post_id") VALUES (?, ?)  [["user_id", 6], ["post_id", 1]]
---
  def create
    Postlike.create(user_id: params[:users_id], post_id: params[:posts_id])