app/controllers/profiles_controller.rb

  def create
    profile = Profile.new
    p = params[:profile]
    profile.real_name = p[:real_name] if p[:real_name]
    profile.alias = p[:alias] if p[:alias]
    profile.birthday = p[:birthday] if p[:birthday]
    profile.location = p[:location] if p[:location]
    profile.bio = p[:bio] if p[:bio]
    profile.user_id = params[:user_id]
    if profile.save
---
INSERT INTO "profiles" ("user_id", "real_name", "alias", "birthday", "location", "bio") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["real_name", "Testbot2"], ["alias", ""], ["birthday", "November 15th, 2018"], ["location", "Grand Rapids"], ["bio", "I am the second testbot. "]]

  def update
    profile = Profile.find(params[:id])
    p = params[:profile]
    profile.real_name = p[:real_name]
    profile.alias = p[:alias]
    profile.birthday = p[:birthday]
    profile.location = p[:location]
    profile.bio = p[:bio]
    if profile.save
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "profiles" SET "birthday" = ?, "location" = ? WHERE "profiles"."id" = ?  [["birthday", "November 15th, 2018, 10:36 PM"], ["location", "Grand Rapids, MI"], ["id", 2]]