app/controllers/users_controller.rb

    def set_user
      @user = User.find(params[:id]) || @user = current_user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]