app/models/blogpost.rb

  def likes
    self.blogpostlikes.size
---
SELECT COUNT(*) FROM "blogpostlikes" WHERE "blogpostlikes"."blogpost_id" = ?  [["blogpost_id", 2]]