app/models/comment.rb

SELECT COUNT(*) FROM "commentlikes" WHERE "commentlikes"."comment_id" = ?  [["comment_id", 2]]
---
  def likes
    self.commentlikes.size