app/models/interest.rb

SELECT "users".* FROM "users" INNER JOIN "user_interests" ON "users"."id" = "user_interests"."user_id" WHERE "user_interests"."interest_id" = ?  [["interest_id", 1]]
---
  def user_names
    self.users.map do |user|