app/models/post.rb

SELECT COUNT(*) FROM "postlikes" WHERE "postlikes"."post_id" = ?  [["post_id", 1]]
---
  def likes
    self.postlikes.size