app/models/user.rb

  def display_name
    if self.profile
      if !self.profile.real_name.empty? && !self.profile.real_name.nil?
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def likes?(comment)
    comment.commentlikes.find{|commentlike| commentlike.user_id == self.id} ? true : false
---
SELECT "commentlikes".* FROM "commentlikes" WHERE "commentlikes"."comment_id" = ?  [["comment_id", 11]]

  def likes_post?(post)
    post.postlikes.find{|postlike| postlike.user_id == self.id} ? true : false
---
SELECT "postlikes".* FROM "postlikes" WHERE "postlikes"."post_id" = ?  [["post_id", 1]]

  def likes_blogpost?(blogpost)
    blogpost.blogpostlikes.find{|blogpostlike| blogpostlike.user_id == self.id} ? true: false
---
SELECT "blogpostlikes".* FROM "blogpostlikes" WHERE "blogpostlikes"."blogpost_id" = ?  [["blogpost_id", 2]]