app/views/_blogpostlikes.html.erb

<% else %>
<form action="/blogpostlikes/<%= blogpost.find_blogpostlike(current_user).id %>" method='post'>
---
SELECT "blogpostlikes".* FROM "blogpostlikes" WHERE "blogpostlikes"."blogpost_id" = ?  [["blogpost_id", 2]]
SELECT "blogposts".* FROM "blogposts" WHERE "blogposts"."user_id" = ?  [["user_id", 1]]