app/views/_commentlikes.html.erb

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."id" DESC LIMIT ?  [["post_id", 1], ["LIMIT", 1]]
SELECT "commentlikes".* FROM "commentlikes" WHERE "commentlikes"."comment_id" = ?  [["comment_id", 2]]
---
<% else %>
<form action="/commentlikes/<%= comment.find_commentlike(current_user).id %>" method='post'>