app/views/_postlikes.html.erb

<% else %>
<form action="/postlikes/<%= post.find_postlike(current_user).id %>" method='post'>
---
SELECT "postlikes".* FROM "postlikes" WHERE "postlikes"."post_id" = ?  [["post_id", 1]]